# Dataframes
A data frame has the variables of a data set as columns and the observations as rows. Unlike Matrices Dataframes can take dissmilar data types as elements.

In [4]:
# create few vectors of dissimilar data
Names <- c('Sree', 'Devi', 'Praneetha', 'Lavanya', 'Prabhu', 'Vani', 'Vaishnavi', 'Nirmal')
Gender<- c("Male", "Female", "Female", "Female","Male", "Female", "Female", "Male")
Ages <- c(53, 50, 29, 27, 51, 48, 14, 19)
City <- c("Hyderabad", 'Hyderbad', "Bangalore", "Newgercy", "Kurnool", "Emmiganur","Kurnool", "Kurnool")
# Combine all of these to form a data frame 
family_df <- data.frame(Names, Gender, Ages, City)
family_df

  Names     Gender Ages City
1 Sree      Male   53   Hyderabad
2 Devi      Female 50   Hyderbad
3 Praneetha Female 29   Bangalore
4 Lavanya   Female 27   Newgercy
5 Prabhu    Male   51   Kurnool
6 Vani      Female 48   Emmiganur
7 Vaishnavi Female 14   Kurnool
8 Nirmal    Male   19   Kurnool

In [20]:
family_mat = matrix(Names, ncol = 1, nrow = 8)
family_mat = cbind(family_mat , Gender,Ages,City)
family_mat

               Gender Ages City
[1,] Sree      Male   53   Hyderabad
[2,] Devi      Female 50   Hyderbad
[3,] Praneetha Female 29   Bangalore
[4,] Lavanya   Female 27   Newgercy
[5,] Prabhu    Male   51   Kurnool
[6,] Vani      Female 48   Emmiganur
[7,] Vaishnavi Female 14   Kurnool
[8,] Nirmal    Male   19   Kurnool

In [27]:
#Although both family_mat, family_df appear same, there is  a difference
# let us look at the class of Ages elements in both the cases.
paste("The class of Age element in Matrix --- ", class(family_mat[1,3]))
paste("The class of Age element in Matrix --- ",class(family_df[1,3]))

[1] "The class of Age element in Matrix ---  character"

[1] "The class of Age element in Matrix ---  numeric"

# 
Ages vector has numeric data in it. Now in the matrix is coerced to 'character' data. Matrix contains only one class type data in in. Where as the same thing remained as numeric in data frame. Data frame can take up dissimilar class data elements.

# Structure of a data frame

In [28]:
str(family_df)

'data.frame':	8 obs. of  4 variables:
 $ Names : Factor w/ 8 levels "Devi","Lavanya",..: 6 1 5 2 4 8 7 3
 $ Gender: Factor w/ 2 levels "Female","Male": 2 1 1 1 2 1 1 2
 $ Ages  : num  53 50 29 27 51 48 14 19
 $ City  : Factor w/ 6 levels "Bangalore","Emmiganur",..: 3 4 1 6 5 2 5 5

# Selecting dataframe data (columnwise, Row wise)

In [49]:
#column selecton 
family_df[,3] # column 3 selected as a vector
family_df$Ages # Same as above but with name
# Row selection
family_df[1,] # Row wise 1st Row

[1] 53 50 29 27 51 48 14 19

[1] 53 50 29 27 51 48 14 19

  Names Gender Ages City
1 Sree  Male   53   Hyderabad

# Selecting a subset with a condition

In [54]:
subset(family_df,subset = Ages>20)

  Names     Gender Ages City
1 Sree      Male   53   Hyderabad
2 Devi      Female 50   Hyderbad
3 Praneetha Female 29   Bangalore
4 Lavanya   Female 27   Newgercy
5 Prabhu    Male   51   Kurnool
6 Vani      Female 48   Emmiganur

In [67]:
subset(family_df, subset =(Gender == 'Male')) # Note == double logical expression

  Names  Gender Ages City
1 Sree   Male   53   Hyderabad
5 Prabhu Male   51   Kurnool
8 Nirmal Male   19   Kurnool

# order() function on a vector for sorting the same

In [69]:
# order() function returns a ranked position of the each element of the vector
A = c(2,201, 1, 5, 90, 33)
A

[1]   2 201   1   5  90  33

In [70]:
order(A)# This gives a vector from 1 to n as per the order of the A

[1] 3 1 4 6 5 2

# Rearranging the dataframe in the Ages order.

In [93]:
ages_sorted = order(Ages) # Get the ranking of the ages

In [94]:
ages_sorted # Observe the 1 to 7 ranking based on the age here.

[1] 7 8 4 3 6 2 5 1

In [95]:
# now sort the family_df as per the ages
family_df[ages_sorted,] #whole data  frame gets sorted as per the ranks

  Names     Gender Ages City
7 Vaishnavi Female 14   Kurnool
8 Nirmal    Male   19   Kurnool
4 Lavanya   Female 27   Newgercy
3 Praneetha Female 29   Bangalore
6 Vani      Female 48   Emmiganur
2 Devi      Female 50   Hyderbad
5 Prabhu    Male   51   Kurnool
1 Sree      Male   53   Hyderabad